{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "import sqlite3\n",
    "import pandas as pd\n",
    "import warnings\n",
    "from loguru import logger\n",
    "\n",
    "warnings.filterwarnings('ignore')\n",
    "\n",
    "# Optioneel: Sla de logs ook op in een bestand\n",
    "logger.add(\"sdm_pipeline.log\", rotation=\"1 MB\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "  Opdracht 5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "  Opdracht 5.a\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "  Reset, Create en Load Database functies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "def reset_sdm():\n",
    "    with sqlite3.connect('sdm.db') as conn:\n",
    "        tables = pd.read_sql(\n",
    "            \"SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite_%';\", conn)\n",
    "        cursor = conn.cursor()\n",
    "        for table in tables['name']:\n",
    "            cursor.execute(f\"DROP TABLE IF EXISTS {table}\")\n",
    "        conn.commit()\n",
    "    logger.success(\"Database succesvol geleegd.\")\n",
    "\n",
    "\n",
    "def create_sdm_tables():\n",
    "    sql_file = 'BikeToDrive_RIM - alle bestanden.txt'\n",
    "    if not os.path.exists(sql_file):\n",
    "        logger.warning(f\"Let op: {sql_file} niet gevonden!\")\n",
    "        return\n",
    "\n",
    "    with open(sql_file, 'r', encoding='utf-8') as f:\n",
    "        sql = f.read()\n",
    "\n",
    "    with sqlite3.connect('sdm.db') as sdm_conn:\n",
    "        cursor = sdm_conn.cursor()\n",
    "        statements = [stmt.strip() for stmt in sql.split(\n",
    "            ';') if stmt.strip() and not stmt.strip().startswith('--')]\n",
    "\n",
    "        for stmt in statements:\n",
    "            try:\n",
    "                cursor.execute(stmt)\n",
    "            except Exception as e:\n",
    "                logger.error(f\"Error bij uitvoeren DDL: {e} voor {stmt[:50]}...\")\n",
    "        sdm_conn.commit()\n",
    "    logger.success(\"Tabellen succesvol aangemaakt in SDM.\")\n",
    "\n",
    "\n",
    "def load_data_to_sdm():\n",
    "    mappings = {\n",
    "        'BikeToDrive_1_Accessoireverkoop.db': {\n",
    "            'Accessoire_Verkoop': 'Accessoireverkoop',\n",
    "            'Monteur': 'Accessoireverkoop_Monteur',\n",
    "            'Leverancier': 'Accessoireverkoop_Leverancier',\n",
    "            'Accessoire': 'Accessoireverkoop_Accessoire',\n",
    "            'Filiaal': 'Accessoireverkoop_filiaal',\n",
    "            'Klant': 'Accessoireverkoop_klant'\n",
    "        },\n",
    "        'BikeToDrive_2_Fietsverkoop.db': {\n",
    "            'Fiets_Verkoop': 'Fietsverkoop',\n",
    "            'Fiets': 'Fietsverkoop_Fiets',\n",
    "            'Monteur': 'Fietsverkoop_Monteur',\n",
    "            'Fabrikant': 'Fietsverkoop_Fabrikant',\n",
    "            'Filiaal': 'Fietsverkoop_filiaal',\n",
    "            'Klant': 'Fietsverkoop_klant'\n",
    "        },\n",
    "        'BikeToDrive_3_Onderhoud.db': {\n",
    "            'Onderhoud': 'Onderhoud',\n",
    "            'Fiets': 'Onderhoud_Fiets',\n",
    "            'Monteur': 'Onderhoud_Monteur',\n",
    "            'Fabrikant': 'Onderhoud_Fabrikant',\n",
    "            'Filiaal': 'Onderhoud_filiaal'\n",
    "        },\n",
    "        'BikeToDrive_4_Accessoire_Inkoop.db': {\n",
    "            'Accessoire_Inkoop': 'Accessoire_inkoop',\n",
    "            'Accessoire': 'Accessoire_inkoop_Accessoire',\n",
    "            'Leverancier': 'Accessoire_inkoop_Leverancier'\n",
    "        },\n",
    "        'BikeToDrive_5_Fiets_Inkoop.db': {\n",
    "            'Fiets_Inkoop': 'Fiets_Inkoop',\n",
    "            'Fiets': 'Fiets_Inkoop_Fiets',\n",
    "            'Fabrikant': 'Fiets_Inkoop_Fabrikant'\n",
    "        }\n",
    "    }\n",
    "\n",
    "    with sqlite3.connect('sdm.db') as sdm_conn:\n",
    "        for db, table_map in mappings.items():\n",
    "            if not os.path.exists(db):\n",
    "                logger.warning(f\"Bron DB '{db}' niet gevonden. Wordt overgeslagen.\")\n",
    "                continue\n",
    "\n",
    "            with sqlite3.connect(db) as conn:\n",
    "                for src_table, dst_table in table_map.items():\n",
    "                    try:\n",
    "                        df = pd.read_sql(f\"SELECT * FROM {src_table}\", conn)\n",
    "                        df.to_sql(dst_table, sdm_conn,\n",
    "                                  if_exists='append', index=False)\n",
    "                        logger.info(\n",
    "                            f\"Geladen: {len(df)} rijen van {src_table} -> {dst_table}\")\n",
    "                    except Exception as e:\n",
    "                        logger.error(f\"Fout bij inladen {src_table}: {e}\")\n",
    "\n",
    "    logger.success(\"Data laden completed.\")\n",
    "\n",
    "\n",
    "def full_refresh_sdm():\n",
    "    logger.info(\"Start Full Refresh...\")\n",
    "    reset_sdm()\n",
    "    create_sdm_tables()\n",
    "    load_data_to_sdm()\n",
    "    logger.success(\"Full refresh van SDM completed.\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "  Opdracht 5.b\n",
    "\n",
    "\n",
    "\n",
    "  Database testen en exploreren"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\u001b[32m2026-04-09 14:10:22.236\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m14\u001b[0m - \u001b[1mBikeToDrive_1_Accessoireverkoop.db: ['Accessoire_Verkoop', 'Monteur', 'Leverancier', 'Accessoire', 'Filiaal', 'Klant']\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.240\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m14\u001b[0m - \u001b[1mBikeToDrive_2_Fietsverkoop.db: ['Fiets_Verkoop', 'Fiets', 'Monteur', 'Fabrikant', 'Filiaal', 'Klant']\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.242\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m14\u001b[0m - \u001b[1mBikeToDrive_3_Onderhoud.db: ['Onderhoud', 'Fiets', 'Monteur', 'Fabrikant', 'Filiaal']\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.244\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m14\u001b[0m - \u001b[1mBikeToDrive_4_Accessoire_Inkoop.db: ['Accessoire_Inkoop', 'Accessoire', 'Leverancier']\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.245\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m14\u001b[0m - \u001b[1mBikeToDrive_5_Fiets_Inkoop.db: ['Fiets_Inkoop', 'Fiets', 'Fabrikant']\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "dbs = [\n",
    "    'BikeToDrive_1_Accessoireverkoop.db',\n",
    "    'BikeToDrive_2_Fietsverkoop.db',\n",
    "    'BikeToDrive_3_Onderhoud.db',\n",
    "    'BikeToDrive_4_Accessoire_Inkoop.db',\n",
    "    'BikeToDrive_5_Fiets_Inkoop.db'\n",
    "]\n",
    "\n",
    "for db in dbs:\n",
    "    if os.path.exists(db):\n",
    "        with sqlite3.connect(db) as conn:\n",
    "            tables = pd.read_sql(\n",
    "                \"SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite_%'\", conn)\n",
    "            logger.info(f\"{db}: {list(tables['name'])}\")\n",
    "    else:\n",
    "        logger.warning(f\"{db} not found\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\u001b[32m2026-04-09 14:10:22.254\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m4\u001b[0m - \u001b[1m--- Aantal unieke ID's in gedeelde tabellen over de databases ---\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.258\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m17\u001b[0m - \u001b[1mKlant: 26 unique IDs gevonden\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.262\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m17\u001b[0m - \u001b[1mMonteur: 15 unique IDs gevonden\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.267\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m17\u001b[0m - \u001b[1mFiliaal: 5 unique IDs gevonden\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.271\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m17\u001b[0m - \u001b[1mLeverancier: 5 unique IDs gevonden\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.274\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m17\u001b[0m - \u001b[1mAccessoire: 13 unique IDs gevonden\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.279\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m17\u001b[0m - \u001b[1mFiets: 75 unique IDs gevonden\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.282\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m17\u001b[0m - \u001b[1mFabrikant: 11 unique IDs gevonden\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "shared_tables = ['Klant', 'Monteur', 'Filiaal',\n",
    "                 'Leverancier', 'Accessoire', 'Fiets', 'Fabrikant']\n",
    "\n",
    "logger.info(\"--- Aantal unieke ID's in gedeelde tabellen over de databases ---\")\n",
    "for table in shared_tables:\n",
    "    ids = set()\n",
    "    for db in dbs:\n",
    "        if not os.path.exists(db):\n",
    "            continue\n",
    "        try:\n",
    "            with sqlite3.connect(db) as conn:\n",
    "                df = pd.read_sql(f\"SELECT * FROM {table}\", conn)\n",
    "                pk_col = df.columns[0]\n",
    "                ids.update(df[pk_col].tolist())\n",
    "        except:\n",
    "            pass\n",
    "    logger.info(f\"{table}: {len(ids)} unique IDs gevonden\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\u001b[32m2026-04-09 14:10:22.289\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m6\u001b[0m - \u001b[1mKlant columns in Accessoireverkoop: ['klantnr', 'naam', 'adres', 'woonplaats', 'geslacht', 'geboortedatum']\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.297\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m8\u001b[0m - \u001b[1mData preview Klant:\n",
      "   klantnr           naam           adres               woonplaats geslacht  \\\n",
      "0        1     Jan Jansen   Kerkstraat 12  Gewijzigde Test Locatie        M   \n",
      "1        3  Pieter Visser   Havenstraat 3                 Den Haag        M   \n",
      "2        4      Emma Smit    Boomgaard 22                  Haarlem        V   \n",
      "3        5     Tom Bakker  Stationsweg 44                   Leiden        M   \n",
      "4        6    Lisa Meijer   Dijkstraat 10                  Zaandam        V   \n",
      "\n",
      "  geboortedatum  \n",
      "0    1985-03-22  \n",
      "1    1978-11-05  \n",
      "2    1995-02-18  \n",
      "3    1982-09-09  \n",
      "4    1993-12-30  \u001b[0m\n"
     ]
    }
   ],
   "source": [
    "if os.path.exists('BikeToDrive_1_Accessoireverkoop.db'):\n",
    "    with sqlite3.connect('BikeToDrive_1_Accessoireverkoop.db') as conn:\n",
    "        cursor = conn.cursor()\n",
    "        cursor.execute(\"PRAGMA table_info(Klant)\")\n",
    "        columns = cursor.fetchall()\n",
    "        logger.info(f\"Klant columns in Accessoireverkoop: {[col[1] for col in columns]}\")\n",
    "        df = pd.read_sql(\"SELECT * FROM Klant LIMIT 5\", conn)\n",
    "        logger.info(f\"Data preview Klant:\\n{df.head()}\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "  Opdracht 6 - Mutaties en CDC Testing"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\u001b[32m2026-04-09 14:10:22.313\u001b[0m | \u001b[32m\u001b[1mSUCCESS \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m21\u001b[0m - \u001b[32m\u001b[1mStap 1: INSERT, UPDATE en DELETE succesvol uitgevoerd op de bron-database.\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.314\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m30\u001b[0m - \u001b[1mStarten met Full Refresh van het SDM om wijzigingen op te halen...\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.315\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mfull_refresh_sdm\u001b[0m:\u001b[36m93\u001b[0m - \u001b[1mStart Full Refresh...\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.422\u001b[0m | \u001b[32m\u001b[1mSUCCESS \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mreset_sdm\u001b[0m:\u001b[36m9\u001b[0m - \u001b[32m\u001b[1mDatabase succesvol geleegd.\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.512\u001b[0m | \u001b[32m\u001b[1mSUCCESS \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mcreate_sdm_tables\u001b[0m:\u001b[36m32\u001b[0m - \u001b[32m\u001b[1mTabellen succesvol aangemaakt in SDM.\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.519\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 100 rijen van Accessoire_Verkoop -> Accessoireverkoop\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.525\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 10 rijen van Monteur -> Accessoireverkoop_Monteur\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.532\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 5 rijen van Leverancier -> Accessoireverkoop_Leverancier\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.538\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 10 rijen van Accessoire -> Accessoireverkoop_Accessoire\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.544\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 4 rijen van Filiaal -> Accessoireverkoop_filiaal\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.546\u001b[0m | \u001b[31m\u001b[1mERROR   \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m87\u001b[0m - \u001b[31m\u001b[1mFout bij inladen Klant: Execution failed\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.553\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 150 rijen van Fiets_Verkoop -> Fietsverkoop\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.559\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 75 rijen van Fiets -> Fietsverkoop_Fiets\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.566\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 10 rijen van Monteur -> Fietsverkoop_Monteur\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.572\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 10 rijen van Fabrikant -> Fietsverkoop_Fabrikant\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.577\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 4 rijen van Filiaal -> Fietsverkoop_filiaal\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.584\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 25 rijen van Klant -> Fietsverkoop_klant\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.591\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 50 rijen van Onderhoud -> Onderhoud\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.597\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 30 rijen van Fiets -> Onderhoud_Fiets\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.603\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 15 rijen van Monteur -> Onderhoud_Monteur\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.609\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 11 rijen van Fabrikant -> Onderhoud_Fabrikant\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.611\u001b[0m | \u001b[31m\u001b[1mERROR   \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m87\u001b[0m - \u001b[31m\u001b[1mFout bij inladen Filiaal: table \"Onderhoud_filiaal\" already exists\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.613\u001b[0m | \u001b[31m\u001b[1mERROR   \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m87\u001b[0m - \u001b[31m\u001b[1mFout bij inladen Accessoire_Inkoop: table \"Accessoire_inkoop\" already exists\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.615\u001b[0m | \u001b[31m\u001b[1mERROR   \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m87\u001b[0m - \u001b[31m\u001b[1mFout bij inladen Accessoire: table \"Accessoire_inkoop_Accessoire\" already exists\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.616\u001b[0m | \u001b[31m\u001b[1mERROR   \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m87\u001b[0m - \u001b[31m\u001b[1mFout bij inladen Leverancier: table \"Accessoire_inkoop_Leverancier\" already exists\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.622\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 100 rijen van Fiets_Inkoop -> Fiets_Inkoop\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.629\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 75 rijen van Fiets -> Fiets_Inkoop_Fiets\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.635\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m84\u001b[0m - \u001b[1mGeladen: 10 rijen van Fabrikant -> Fiets_Inkoop_Fabrikant\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.635\u001b[0m | \u001b[32m\u001b[1mSUCCESS \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mload_data_to_sdm\u001b[0m:\u001b[36m89\u001b[0m - \u001b[32m\u001b[1mData laden completed.\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.636\u001b[0m | \u001b[32m\u001b[1mSUCCESS \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mfull_refresh_sdm\u001b[0m:\u001b[36m97\u001b[0m - \u001b[32m\u001b[1mFull refresh van SDM completed.\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.636\u001b[0m | \u001b[32m\u001b[1mSUCCESS \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m32\u001b[0m - \u001b[32m\u001b[1mStap 2: SDM succesvol opnieuw opgebouwd en geladen met de nieuwste data.\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.637\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m35\u001b[0m - \u001b[1m--- Test Resultaten in SDM (Tabel: Accessoireverkoop_klant) ---\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.638\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m40\u001b[0m - \u001b[1m1. INSERT test (Is de nieuwe klant 9999 aanwezig?):\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.639\u001b[0m | \u001b[31m\u001b[1mERROR   \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m44\u001b[0m - \u001b[31m\u001b[1mGefaald. Klant niet gevonden.\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.640\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m48\u001b[0m - \u001b[1m2. UPDATE test (Heeft klant 1 de nieuwe woonplaats?):\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.641\u001b[0m | \u001b[31m\u001b[1mERROR   \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m52\u001b[0m - \u001b[31m\u001b[1mGefaald. Klant 1 bestaat niet in SDM.\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.642\u001b[0m | \u001b[1mINFO    \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m56\u001b[0m - \u001b[1m3. DELETE test (Is klant 2 succesvol verwijderd uit SDM?):\u001b[0m\n",
      "\u001b[32m2026-04-09 14:10:22.643\u001b[0m | \u001b[32m\u001b[1mSUCCESS \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36m<module>\u001b[0m:\u001b[36m58\u001b[0m - \u001b[32m\u001b[1mSucces! Klant 2 bestaat niet meer in het SDM.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "bron_db = 'BikeToDrive_1_Accessoireverkoop.db'\n",
    "PK_KOLOM = 'klantnr'\n",
    "\n",
    "if os.path.exists(bron_db):\n",
    "    with sqlite3.connect(bron_db) as conn_bron:\n",
    "        cursor_bron = conn_bron.cursor()\n",
    "\n",
    "        try:\n",
    "            # 1. INSERT\n",
    "            cursor_bron.execute(\n",
    "                f\"INSERT INTO Klant ({PK_KOLOM}, naam, woonplaats) VALUES (9999, 'Test Klant Opdracht 6', 'SDM-Stad')\")\n",
    "\n",
    "            # 2. UPDATE\n",
    "            cursor_bron.execute(\n",
    "                f\"UPDATE Klant SET woonplaats = 'Gewijzigde Test Locatie' WHERE {PK_KOLOM} = 1\")\n",
    "\n",
    "            # 3. DELETE\n",
    "            cursor_bron.execute(f\"DELETE FROM Klant WHERE {PK_KOLOM} = 2\")\n",
    "\n",
    "            conn_bron.commit()\n",
    "            logger.success(\"Stap 1: INSERT, UPDATE en DELETE succesvol uitgevoerd op de bron-database.\")\n",
    "\n",
    "        except Exception as e:\n",
    "            logger.error(f\"Er ging iets mis in de brondatabase. Foutmelding: {e}\")\n",
    "            conn_bron.rollback()\n",
    "else:\n",
    "    logger.warning(f\"Brondatabase {bron_db} niet gevonden voor Opdracht 6.\")\n",
    "\n",
    "\n",
    "logger.info(\"Starten met Full Refresh van het SDM om wijzigingen op te halen...\")\n",
    "full_refresh_sdm()\n",
    "logger.success(\"Stap 2: SDM succesvol opnieuw opgebouwd en geladen met de nieuwste data.\")\n",
    "\n",
    "\n",
    "logger.info(\"--- Test Resultaten in SDM (Tabel: Accessoireverkoop_klant) ---\")\n",
    "with sqlite3.connect('sdm.db') as sdm_connection:\n",
    "    try:\n",
    "        df_insert = pd.read_sql(\n",
    "            f\"SELECT * FROM Accessoireverkoop_klant WHERE {PK_KOLOM} = 9999\", sdm_connection)\n",
    "        logger.info(\"1. INSERT test (Is de nieuwe klant 9999 aanwezig?):\")\n",
    "        if not df_insert.empty:\n",
    "            logger.success(f\"Succes! Klant gevonden:\\n{df_insert}\")\n",
    "        else:\n",
    "            logger.error(\"Gefaald. Klant niet gevonden.\")\n",
    "\n",
    "        df_update = pd.read_sql(\n",
    "            f\"SELECT * FROM Accessoireverkoop_klant WHERE {PK_KOLOM} = 1\", sdm_connection)\n",
    "        logger.info(\"2. UPDATE test (Heeft klant 1 de nieuwe woonplaats?):\")\n",
    "        if not df_update.empty:\n",
    "            logger.success(f\"Controleer de onderstaande data op de wijziging (Gewijzigde Test Locatie):\\n{df_update}\")\n",
    "        else:\n",
    "            logger.error(\"Gefaald. Klant 1 bestaat niet in SDM.\")\n",
    "\n",
    "        df_delete = pd.read_sql(\n",
    "            f\"SELECT * FROM Accessoireverkoop_klant WHERE {PK_KOLOM} = 2\", sdm_connection)\n",
    "        logger.info(\"3. DELETE test (Is klant 2 succesvol verwijderd uit SDM?):\")\n",
    "        if df_delete.empty:\n",
    "            logger.success(\"Succes! Klant 2 bestaat niet meer in het SDM.\")\n",
    "        else:\n",
    "            logger.error(\"Gefaald. Klant 2 is nog steeds aanwezig.\")\n",
    "\n",
    "    except Exception as e:\n",
    "        logger.error(f\"Er is een fout opgetreden bij het valideren van het SDM: {e}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.14.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
